Revit 2027 API
ExportLineweightKey Constructor
Overload List
Name | Description
ExportLineweightKey() |  Constructs a new default ExportLineweightKey.
ExportLineweightKey(ExportLineweightKey) |  Constructs a new copy of the input ExportLineweightKey object.
ExportLineweightKey(Int32) |  Constructs a new default ExportLineweightKey using the original line weight as input.
Top
See Also
Reference
ExportLineweightKey Class
Autodesk.Revit.DB Namespace